Revit 2027 API
Railing.GetPath Method
 Gets the railing path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetPath()
Public Function GetPath As IList(Of Curve)
public:
IList<Curve^>^ GetPath()
member GetPath : unit -> IList<Curve>
Return Value
IList<Curve>
 The curve array of the railing path.
Exceptions
Exception | Condition
InapplicableDataException |  The railing has incorrect internal data.
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace